graph(%images_tensors : Float(*, *, *, strides=[32000, 100, 1], requires_grad=0, device=cpu),
      %backbone.body.conv1.weight : Float(64, 3, 7, 7, strides=[147, 49, 7, 1], requires_grad=0, device=cpu),
      %backbone.body.layer1.0.conv1.weight : Float(64, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %backbone.body.layer1.0.conv2.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=0, device=cpu),
      %backbone.body.layer1.0.conv3.weight : Float(256, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %backbone.body.layer1.0.downsample.0.weight : Float(256, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %backbone.body.layer1.1.conv1.weight : Float(64, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %backbone.body.layer1.1.conv2.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=0, device=cpu),
      %backbone.body.layer1.1.conv3.weight : Float(256, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %backbone.body.layer1.2.conv1.weight : Float(64, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %backbone.body.layer1.2.conv2.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=0, device=cpu),
      %backbone.body.layer1.2.conv3.weight : Float(256, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %backbone.body.layer2.0.conv1.weight : Float(128, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.0.conv2.weight : Float(128, 128, 3, 3, strides=[1152, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.0.conv3.weight : Float(512, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.0.downsample.0.weight : Float(512, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.1.conv1.weight : Float(128, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.1.conv2.weight : Float(128, 128, 3, 3, strides=[1152, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.1.conv3.weight : Float(512, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.2.conv1.weight : Float(128, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.2.conv2.weight : Float(128, 128, 3, 3, strides=[1152, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.2.conv3.weight : Float(512, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.3.conv1.weight : Float(128, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.3.conv2.weight : Float(128, 128, 3, 3, strides=[1152, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer2.3.conv3.weight : Float(512, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.0.conv1.weight : Float(256, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.0.conv2.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.0.conv3.weight : Float(1024, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.0.downsample.0.weight : Float(1024, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.1.conv1.weight : Float(256, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.1.conv2.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.1.conv3.weight : Float(1024, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.2.conv1.weight : Float(256, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.2.conv2.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.2.conv3.weight : Float(1024, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.3.conv1.weight : Float(256, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.3.conv2.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.3.conv3.weight : Float(1024, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.4.conv1.weight : Float(256, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.4.conv2.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.4.conv3.weight : Float(1024, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.5.conv1.weight : Float(256, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.5.conv2.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer3.5.conv3.weight : Float(1024, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer4.0.conv1.weight : Float(512, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer4.0.conv2.weight : Float(512, 512, 3, 3, strides=[4608, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer4.0.conv3.weight : Float(2048, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer4.0.downsample.0.weight : Float(2048, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer4.1.conv1.weight : Float(512, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer4.1.conv2.weight : Float(512, 512, 3, 3, strides=[4608, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer4.1.conv3.weight : Float(2048, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer4.2.conv1.weight : Float(512, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.body.layer4.2.conv2.weight : Float(512, 512, 3, 3, strides=[4608, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.body.layer4.2.conv3.weight : Float(2048, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.fpn.inner_blocks.0.weight : Float(256, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.fpn.inner_blocks.0.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %backbone.fpn.inner_blocks.1.weight : Float(256, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.fpn.inner_blocks.1.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %backbone.fpn.inner_blocks.2.weight : Float(256, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.fpn.inner_blocks.2.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %backbone.fpn.inner_blocks.3.weight : Float(256, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=1, device=cpu),
      %backbone.fpn.inner_blocks.3.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %backbone.fpn.layer_blocks.0.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.fpn.layer_blocks.0.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %backbone.fpn.layer_blocks.1.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.fpn.layer_blocks.1.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %backbone.fpn.layer_blocks.2.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.fpn.layer_blocks.2.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %backbone.fpn.layer_blocks.3.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %backbone.fpn.layer_blocks.3.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %rpn.head.conv.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %rpn.head.conv.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %rpn.head.cls_logits.weight : Float(3, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %rpn.head.cls_logits.bias : Float(3, strides=[1], requires_grad=1, device=cpu),
      %rpn.head.bbox_pred.weight : Float(12, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %rpn.head.bbox_pred.bias : Float(12, strides=[1], requires_grad=1, device=cpu),
      %roi_heads.box_head.fc6.weight : Float(1024, 12544, strides=[12544, 1], requires_grad=1, device=cpu),
      %roi_heads.box_head.fc6.bias : Float(1024, strides=[1], requires_grad=1, device=cpu),
      %roi_heads.box_head.fc7.weight : Float(1024, 1024, strides=[1024, 1], requires_grad=1, device=cpu),
      %roi_heads.box_head.fc7.bias : Float(1024, strides=[1], requires_grad=1, device=cpu),
      %roi_heads.box_predictor.cls_score.weight : Float(91, 1024, strides=[1024, 1], requires_grad=1, device=cpu),
      %roi_heads.box_predictor.cls_score.bias : Float(91, strides=[1], requires_grad=1, device=cpu),
      %roi_heads.box_predictor.bbox_pred.weight : Float(364, 1024, strides=[1024, 1], requires_grad=1, device=cpu),
      %roi_heads.box_predictor.bbox_pred.bias : Float(364, strides=[1], requires_grad=1, device=cpu),
      %roi_heads.mask_head.mask_fcn1.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %roi_heads.mask_head.mask_fcn1.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %roi_heads.mask_head.mask_fcn2.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %roi_heads.mask_head.mask_fcn2.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %roi_heads.mask_head.mask_fcn3.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %roi_heads.mask_head.mask_fcn3.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %roi_heads.mask_head.mask_fcn4.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cpu),
      %roi_heads.mask_head.mask_fcn4.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %roi_heads.mask_predictor.conv5_mask.weight : Float(256, 256, 2, 2, strides=[1024, 4, 2, 1], requires_grad=1, device=cpu),
      %roi_heads.mask_predictor.conv5_mask.bias : Float(256, strides=[1], requires_grad=1, device=cpu),
      %roi_heads.mask_predictor.mask_fcn_logits.weight : Float(91, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=1, device=cpu),
      %roi_heads.mask_predictor.mask_fcn_logits.bias : Float(91, strides=[1], requires_grad=1, device=cpu),
      %3780 : Float(requires_grad=0, device=cpu),
      %3781 : Float(requires_grad=0, device=cpu),
      %3782 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %3783 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %3784 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %3785 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %3786 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %3787 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %3788 : Long(requires_grad=0, device=cpu),
      %3796 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3798 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3806 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3808 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3816 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3818 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3826 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %3828 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %3836 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %3838 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %3846 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3848 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3856 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3858 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3866 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %3868 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %3876 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3878 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3886 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3888 : Float(1, 64, 1, 1, strides=[64, 1, 1, 1], requires_grad=0, device=cpu),
      %3896 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %3898 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %3906 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3908 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3916 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3918 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3926 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %3928 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %3936 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %3938 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %3946 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3948 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3956 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3958 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3966 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %3968 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %3976 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3978 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3986 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3988 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %3996 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %3998 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4006 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %4008 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %4016 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %4018 : Float(1, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=0, device=cpu),
      %4026 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4028 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4036 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4038 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4046 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4048 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4056 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4058 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4066 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4068 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4076 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4078 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4086 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4088 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4096 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4098 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4106 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4108 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4116 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4118 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4126 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4128 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4136 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4138 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4146 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4148 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4156 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4158 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4166 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4168 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4176 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4178 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4186 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4188 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4196 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4198 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4206 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4208 : Float(1, 256, 1, 1, strides=[256, 1, 1, 1], requires_grad=0, device=cpu),
      %4216 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4218 : Float(1, 1024, 1, 1, strides=[1024, 1, 1, 1], requires_grad=0, device=cpu),
      %4226 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4228 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4236 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4238 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4246 : Float(1, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=0, device=cpu),
      %4248 : Float(1, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=0, device=cpu),
      %4256 : Float(1, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=0, device=cpu),
      %4258 : Float(1, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=0, device=cpu),
      %4266 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4268 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4276 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4278 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4286 : Float(1, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=0, device=cpu),
      %4288 : Float(1, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=0, device=cpu),
      %4296 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4298 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4306 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4308 : Float(1, 512, 1, 1, strides=[512, 1, 1, 1], requires_grad=0, device=cpu),
      %4316 : Float(1, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=0, device=cpu),
      %4318 : Float(1, 2048, 1, 1, strides=[2048, 1, 1, 1], requires_grad=0, device=cpu),
      %4319 : Float(requires_grad=0, device=cpu),
      %4320 : Float(requires_grad=0, device=cpu),
      %4321 : Float(requires_grad=0, device=cpu),
      %4322 : Float(requires_grad=0, device=cpu),
      %4323 : Float(requires_grad=0, device=cpu),
      %4324 : Float(requires_grad=0, device=cpu),
      %4325 : Float(requires_grad=0, device=cpu),
      %4326 : Float(requires_grad=0, device=cpu),
      %4327 : Float(requires_grad=0, device=cpu),
      %4328 : Float(requires_grad=0, device=cpu),
      %4329 : Float(requires_grad=0, device=cpu),
      %4330 : Float(requires_grad=0, device=cpu),
      %4331 : Float(requires_grad=0, device=cpu),
      %4332 : Float(requires_grad=0, device=cpu),
      %4333 : Float(requires_grad=0, device=cpu),
      %4334 : Float(requires_grad=0, device=cpu),
      %4335 : Float(requires_grad=0, device=cpu),
      %4336 : Float(requires_grad=0, device=cpu),
      %4337 : Float(requires_grad=0, device=cpu),
      %4338 : Float(requires_grad=0, device=cpu),
      %4339 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4340 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4341 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4342 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4343 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4344 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4345 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4346 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4347 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4348 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4349 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4350 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4351 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4352 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4353 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4354 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4355 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4356 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4357 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4358 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4359 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4360 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4361 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4362 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4363 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4364 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4365 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4366 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4367 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4368 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4369 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4370 : Float(requires_grad=0, device=cpu),
      %4371 : Float(requires_grad=0, device=cpu),
      %4372 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4373 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4374 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4375 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4376 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4377 : Float(requires_grad=0, device=cpu),
      %4378 : Float(requires_grad=0, device=cpu),
      %4379 : Float(requires_grad=0, device=cpu),
      %4380 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4381 : Float(requires_grad=0, device=cpu),
      %4382 : Float(requires_grad=0, device=cpu),
      %4383 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4384 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4385 : Float(requires_grad=0, device=cpu),
      %4386 : Float(requires_grad=0, device=cpu),
      %4387 : Float(requires_grad=0, device=cpu),
      %4391 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %4392 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %4393 : Long(1, strides=[1], requires_grad=0, device=cpu)):
  %308 : Long(3, strides=[1], device=cpu) = onnx::Shape(%images_tensors)
  %309 : Long(device=cpu) = onnx::Constant[value={1}]()
  %310 : Long(requires_grad=0, device=cpu) = onnx::Gather[axis=0](%308, %309) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:269:0
  %311 : Long(3, strides=[1], device=cpu) = onnx::Shape(%images_tensors)
  %312 : Long(device=cpu) = onnx::Constant[value={2}]()
  %313 : Long(requires_grad=0, device=cpu) = onnx::Gather[axis=0](%311, %312) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:269:0
  %314 : Float(3, 1, 1, strides=[1, 1, 1], requires_grad=0, device=cpu) = onnx::Constant[value=(1,.,.) =    0.4850  (2,.,.) =    0.4560  (3,.,.) =    0.4060 [ CPUFloatType{3,1,1} ]]()
  %315 : Float(3, *, *, strides=[32000, 100, 1], requires_grad=0, device=cpu) = onnx::Sub(%images_tensors, %314) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:127:0
  %316 : Float(3, 1, 1, strides=[1, 1, 1], requires_grad=0, device=cpu) = onnx::Constant[value=(1,.,.) =    0.2290  (2,.,.) =    0.2240  (3,.,.) =    0.2250 [ CPUFloatType{3,1,1} ]]()
  %317 : Float(3, *, *, strides=[32000, 100, 1], requires_grad=0, device=cpu) = onnx::Div(%315, %316) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:127:0
  %318 : Long(3, strides=[1], requires_grad=0, device=cpu) = onnx::Shape(%317) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/onnx/operators.py:16:0
  %319 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %320 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={-2}]()
  %321 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={9223372036854775807}]()
  %322 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %323 : Long(2, strides=[1], requires_grad=0, device=cpu) = onnx::Slice(%318, %320, %321, %319, %322) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:16:0
  %324 : Long(requires_grad=0, device=cpu) = onnx::ReduceMin[keepdims=0](%323) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:33:0
  %325 : Float(requires_grad=0, device=cpu) = onnx::Cast[to=1](%324) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:33:0
  %326 : Long(requires_grad=0, device=cpu) = onnx::ReduceMax[keepdims=0](%323) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:34:0
  %327 : Float(requires_grad=0, device=cpu) = onnx::Cast[to=1](%326) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:34:0
  %328 : Float(requires_grad=0, device=cpu) = onnx::Constant[value={1}]()
  %329 : Float(requires_grad=0, device=cpu) = onnx::Div(%328, %325) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/_tensor.py:543:0
  %330 : Float(requires_grad=0, device=cpu) = onnx::Constant[value={200}]()
  %331 : Float(requires_grad=0, device=cpu) = onnx::Mul(%329, %330)
  %332 : Float(requires_grad=0, device=cpu) = onnx::Constant[value={1}]()
  %333 : Float(requires_grad=0, device=cpu) = onnx::Div(%332, %327) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/_tensor.py:543:0
  %334 : Float(requires_grad=0, device=cpu) = onnx::Constant[value={300}]()
  %335 : Float(requires_grad=0, device=cpu) = onnx::Mul(%333, %334)
  %336 : Float(requires_grad=0, device=cpu) = onnx::Min(%331, %335) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %337 : Float(1, 3, *, *, strides=[96000, 32000, 100, 1], requires_grad=0, device=cpu) = onnx::Unsqueeze[axes=[0]](%317) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:43:0
  %338 : Long(4, strides=[1], device=cpu) = onnx::Shape(%337)
  %339 : Long(device=cpu) = onnx::Constant[value={2}]()
  %340 : Long(device=cpu) = onnx::Gather[axis=0](%338, %339) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %341 : Float(requires_grad=0, device=cpu) = onnx::Cast[to=1](%340) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %342 : Float(requires_grad=0, device=cpu) = onnx::Cast[to=1](%336) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %343 : Float(requires_grad=0, device=cpu) = onnx::Mul(%341, %342) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %344 : Float(requires_grad=0, device=cpu) = onnx::Cast[to=1](%343) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %345 : Float(requires_grad=0, device=cpu) = onnx::Floor(%344) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %346 : Long(4, strides=[1], device=cpu) = onnx::Shape(%337)
  %347 : Long(device=cpu) = onnx::Constant[value={3}]()
  %348 : Long(device=cpu) = onnx::Gather[axis=0](%346, %347) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %349 : Float(requires_grad=0, device=cpu) = onnx::Cast[to=1](%348) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %350 : Float(requires_grad=0, device=cpu) = onnx::Cast[to=1](%336) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %351 : Float(requires_grad=0, device=cpu) = onnx::Mul(%349, %350) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %352 : Float(requires_grad=0, device=cpu) = onnx::Cast[to=1](%351) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %353 : Float(requires_grad=0, device=cpu) = onnx::Floor(%352) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3632:0
  %354 : Float(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%345)
  %355 : Float(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%353)
  %356 : Float(2, strides=[1], device=cpu) = onnx::Concat[axis=0](%354, %355)
  %357 : Long(4, strides=[1], device=cpu) = onnx::Shape(%337)
  %358 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %359 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %360 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={2}]()
  %361 : Long(2, strides=[1], device=cpu) = onnx::Slice(%357, %359, %360, %358)
  %362 : Long(2, strides=[1], device=cpu) = onnx::Cast[to=7](%356)
  %363 : Long(4, strides=[1], device=cpu) = onnx::Concat[axis=0](%361, %362)
  %364 : Float(0, strides=[1], device=cpu) = onnx::Constant[value=[ CPUFloatType{0} ]]()
  %365 : Float(0, strides=[1], device=cpu) = onnx::Constant[value=[ CPUFloatType{0} ]]()
  %366 : Float(*, *, *, *, strides=[83700, 27900, 93, 1], requires_grad=0, device=cpu) = onnx::Resize[coordinate_transformation_mode="pytorch_half_pixel", cubic_coeff_a=-0.75, mode="linear", nearest_mode="floor"](%337, %364, %365, %363) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:3662:0
  %367 : Long(requires_grad=0, device=cpu) = onnx::Constant[value={0}]()
  %368 : Float(*, *, *, strides=[27900, 93, 1], requires_grad=0, device=cpu) = onnx::Gather[axis=0](%366, %367) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:42:0
  %369 : Long(3, strides=[1], device=cpu) = onnx::Shape(%368)
  %370 : Long(device=cpu) = onnx::Constant[value={1}]()
  %371 : Long(requires_grad=0, device=cpu) = onnx::Gather[axis=0](%369, %370) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:270:0
  %372 : Long(3, strides=[1], device=cpu) = onnx::Shape(%368)
  %373 : Long(device=cpu) = onnx::Constant[value={2}]()
  %374 : Long(requires_grad=0, device=cpu) = onnx::Gather[axis=0](%372, %373) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:270:0
  %375 : Long(3, strides=[1], device=cpu) = onnx::Shape(%368)
  %376 : Long(device=cpu) = onnx::Constant[value={0}]()
  %377 : Long(device=cpu) = onnx::Gather[axis=0](%375, %376) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %378 : Long(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%377)
  %379 : Long(1, strides=[1], requires_grad=0, device=cpu) = onnx::Concat[axis=0](%378) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %380 : Float(1, strides=[1], requires_grad=0, device=cpu) = onnx::Cast[to=1](%379) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %381 : Float(requires_grad=0, device=cpu) = onnx::ReduceMax[keepdims=0](%380) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %382 : Long(requires_grad=0, device=cpu) = onnx::Cast[to=7](%381) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %383 : Long(3, strides=[1], device=cpu) = onnx::Shape(%368)
  %384 : Long(device=cpu) = onnx::Constant[value={1}]()
  %385 : Long(device=cpu) = onnx::Gather[axis=0](%383, %384) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %386 : Long(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%385)
  %387 : Long(1, strides=[1], requires_grad=0, device=cpu) = onnx::Concat[axis=0](%386) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %388 : Float(1, strides=[1], requires_grad=0, device=cpu) = onnx::Cast[to=1](%387) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %389 : Float(requires_grad=0, device=cpu) = onnx::ReduceMax[keepdims=0](%388) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %390 : Long(requires_grad=0, device=cpu) = onnx::Cast[to=7](%389) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %391 : Long(3, strides=[1], device=cpu) = onnx::Shape(%368)
  %392 : Long(device=cpu) = onnx::Constant[value={2}]()
  %393 : Long(device=cpu) = onnx::Gather[axis=0](%391, %392) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %394 : Long(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%393)
  %395 : Long(1, strides=[1], requires_grad=0, device=cpu) = onnx::Concat[axis=0](%394) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %396 : Float(1, strides=[1], requires_grad=0, device=cpu) = onnx::Cast[to=1](%395) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %397 : Float(requires_grad=0, device=cpu) = onnx::ReduceMax[keepdims=0](%396) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %398 : Long(requires_grad=0, device=cpu) = onnx::Cast[to=7](%397) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:169:0
  %399 : Float(requires_grad=0, device=cpu) = onnx::Cast[to=1](%390) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:172:0
  %402 : Float(requires_grad=0, device=cpu) = onnx::Div(%399, %3780)
  %403 : Float(requires_grad=0, device=cpu) = onnx::Ceil(%402) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:172:0
  %404 : Float(requires_grad=0, device=cpu) = onnx::Constant[value={32}]()
  %405 : Float(requires_grad=0, device=cpu) = onnx::Mul(%403, %404)
  %406 : Long(requires_grad=0, device=cpu) = onnx::Cast[to=7](%405) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:172:0
  %407 : Float(requires_grad=0, device=cpu) = onnx::Cast[to=1](%398) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:173:0
  %410 : Float(requires_grad=0, device=cpu) = onnx::Div(%407, %3781)
  %411 : Float(requires_grad=0, device=cpu) = onnx::Ceil(%410) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:173:0
  %412 : Float(requires_grad=0, device=cpu) = onnx::Constant[value={32}]()
  %413 : Float(requires_grad=0, device=cpu) = onnx::Mul(%411, %412)
  %414 : Long(requires_grad=0, device=cpu) = onnx::Cast[to=7](%413) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:173:0
  %415 : Long(3, strides=[1], device=cpu) = onnx::Shape(%368)
  %416 : Long(device=cpu) = onnx::Constant[value={0}]()
  %417 : Long(device=cpu) = onnx::Gather[axis=0](%415, %416) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:181:0
  %418 : Long(3, strides=[1], device=cpu) = onnx::Shape(%368)
  %419 : Long(device=cpu) = onnx::Constant[value={1}]()
  %420 : Long(device=cpu) = onnx::Gather[axis=0](%418, %419) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:181:0
  %421 : Long(3, strides=[1], device=cpu) = onnx::Shape(%368)
  %422 : Long(device=cpu) = onnx::Constant[value={2}]()
  %423 : Long(device=cpu) = onnx::Gather[axis=0](%421, %422) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:181:0
  %424 : Long(requires_grad=0, device=cpu) = onnx::Sub(%382, %417) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:181:0
  %425 : Long(requires_grad=0, device=cpu) = onnx::Sub(%406, %420) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:181:0
  %426 : Long(requires_grad=0, device=cpu) = onnx::Sub(%414, %423) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:181:0
  %431 : Long(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%426)
  %433 : Long(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%425)
  %435 : Long(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%424)
  %436 : Long(6, strides=[1], device=cpu) = onnx::Concat[axis=0](%3782, %431, %3783, %433, %3784, %435)
  %438 : Long(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%426)
  %440 : Long(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%425)
  %442 : Long(1, strides=[1], device=cpu) = onnx::Unsqueeze[axes=[0]](%424)
  %443 : Long(6, strides=[1], device=cpu) = onnx::Concat[axis=0](%3785, %438, %3786, %440, %3787, %442)
  %444 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %445 : Long(1, strides=[1], device=cpu) = onnx::Shape(%436)
  %446 : Long(1, strides=[1], device=cpu) = onnx::Gather[axis=0](%445, %444)
  %450 : Long(1, strides=[1], device=cpu) = onnx::Sub(%3788, %446)
  %451 : Long(6, strides=[1], device=cpu) = onnx::Cast[to=7](%443)
  %452 : Long(0, device=cpu) = onnx::ConstantOfShape[value={0}](%450)
  %453 : Long(6, strides=[1], device=cpu) = onnx::Concat[axis=0](%451, %452)
  %454 : Long(2, strides=[1], device=cpu) = onnx::Constant[value=-1  2 [ CPULongType{2} ]]()
  %455 : Long(3, 2, strides=[2, 1], device=cpu) = onnx::Reshape(%453, %454)
  %456 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %457 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={-1}]()
  %458 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={-9223372036854775807}]()
  %459 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={-1}]()
  %460 : Long(3, 2, strides=[2, 1], device=cpu) = onnx::Slice(%455, %457, %458, %456, %459)
  %461 : Long(2, 3, strides=[3, 1], device=cpu) = onnx::Transpose[perm=[1, 0]](%460)
  %462 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={-1}]()
  %463 : Long(6, strides=[1], device=cpu) = onnx::Reshape(%461, %462)
  %464 : Long(6, strides=[1], device=cpu) = onnx::Cast[to=7](%463)
  %465 : Float(device=cpu) = onnx::Constant[value={0}]()
  %466 : Float(*, *, *, strides=[30720, 96, 1], requires_grad=0, device=cpu) = onnx::Pad[mode="constant"](%368, %464, %465) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:4106:0
  %467 : Float(1, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[0]](%466)
  %468 : Float(1, *, *, *, strides=[92160, 30720, 96, 1], requires_grad=0, device=cpu) = onnx::Concat[axis=0](%467) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/detection/transform.py:185:0
  %469 : Float(1, 64, *, *, strides=[491520, 7680, 48, 1], requires_grad=0, device=cpu) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[7, 7], pads=[3, 3, 3, 3], strides=[2, 2]](%468, %backbone.body.conv1.weight) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/modules/conv.py:429:0
  %486 : Float(1, 64, *, *, strides=[491520, 7680, 48, 1], requires_grad=0, device=cpu) = onnx::Mul(%469, %3796) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %487 : Float(1, 64, *, *, strides=[491520, 7680, 48, 1], requires_grad=0, device=cpu) = onnx::Add(%486, %3798) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %488 : Float(1, 64, *, *, strides=[491520, 7680, 48, 1], requires_grad=0, device=cpu) = onnx::Relu(%487) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:1309:0
  %489 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::MaxPool[ceil_mode=0, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[2, 2]](%488) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:726:0
  %490 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[1, 1], pads=[0, 0, 0, 0], strides=[1, 1]](%489, %backbone.body.layer1.0.conv1.weight) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/modules/conv.py:429:0
  %507 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Mul(%490, %3806) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %508 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Add(%507, %3808) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %509 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Relu(%508) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:1309:0
  %510 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%509, %backbone.body.layer1.0.conv2.weight) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/modules/conv.py:429:0
  %527 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Mul(%510, %3816) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %528 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Add(%527, %3818) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %529 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Relu(%528) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:1309:0
  %530 : Float(1, 256, *, *, strides=[491520, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[1, 1], pads=[0, 0, 0, 0], strides=[1, 1]](%529, %backbone.body.layer1.0.conv3.weight) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/modules/conv.py:429:0
  %547 : Float(1, 256, *, *, strides=[491520, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Mul(%530, %3826) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %548 : Float(1, 256, *, *, strides=[491520, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Add(%547, %3828) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %549 : Float(1, 256, *, *, strides=[491520, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[1, 1], pads=[0, 0, 0, 0], strides=[1, 1]](%489, %backbone.body.layer1.0.downsample.0.weight) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/modules/conv.py:429:0
  %566 : Float(1, 256, *, *, strides=[491520, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Mul(%549, %3836) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %567 : Float(1, 256, *, *, strides=[491520, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Add(%566, %3838)
  %568 : Float(1, 256, *, *, strides=[491520, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Add(%548, %567) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/models/resnet.py:138:0
  %569 : Float(1, 256, *, *, strides=[491520, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Relu(%568)
  %570 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[1, 1], pads=[0, 0, 0, 0], strides=[1, 1]](%569, %backbone.body.layer1.1.conv1.weight) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/modules/conv.py:429:0
  %587 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Mul(%570, %3846) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %588 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Add(%587, %3848) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %589 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Relu(%588) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:1309:0
  %590 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%589, %backbone.body.layer1.1.conv2.weight) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/modules/conv.py:429:0
  %607 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Mul(%590, %3856) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %608 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Add(%607, %3858) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torchvision/ops/misc.py:96:0
  %609 : Float(1, 64, *, *, strides=[122880, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Relu(%608) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/functional.py:1309:0
  %610 : Float(1, 256, *, *, strides=[491520, 1920, 24, 1], requires_grad=0, device=cpu) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[1, 1], pads=[0, 0, 0, 0], strides=[1, 1]](%609, %backbone.body.layer1.1.conv3.weight) # /Users/seankinzer/.pyenv/versions/3.8.8/lib/python3.8/site-packages/torch/nn/modules/conv.py:429:0
